// © Copyright 2011-2013, 2015-2016 HP Development Company, L.P.

TaskName = "Configurazione wireless";
TaskTOCTitle = "Connessione wireless automatica HP";
ConfirmSettingsTaskName = "Conferma Connessione wireless automatica HP";
ConfirmSettingsTaskTOCTitle = "Conferma impostazioni wireless";
NetworkSelectTaskName = "Seleziona rete";
DeviceDiscoveryTaskName = "Seleziona dispositivo";
DeviceDiscoveryTaskTitle = "Seleziona il dispositivo da configurare";
ConfigureSettingsTaskName = "Configurazione del dispositivo";
ResultsTaskName = "Risultati di configurazione";

// confirmation pane
ConfirmationDescriptionText = "Se si decide di utilizzare la funzione Connessione wireless automatica HP, il computer si disconnetterà temporaneamente dalla rete wireless per permettere il completamento di eventuali download/upload già in corso. Questa interruzione dovrebbe durare circa trenta secondi, poi la connessione wireless verrà ristabilita.";
HostNetworkDetectedTitle = "L'applicazione ha rilevato che il computer è connesso a una rete wireless con le seguenti impostazioni:";
WirelessNetworkNameTitle = "Nome della rete wireless:";
CommunicationModeTitle = "Modalità di comunicazione:";
EncryptionTypeTitle = "Tipo di codifica:";

WirelessNetworkChooseTitle = "Configurare il dispositivo per utilizzare le impostazioni definite?";
KeepCurrentNetworkSettingsTitle = "Sì, mantieni queste impostazioni.";
ChooseAnotherNetworkSettingsTitle = "No, voglio selezionare un'altra rete.";
ShowSettingsTitle = "Mostra impostazioni";

// network selection pane
NetworkSelectTitle = "Selezionare il nome della rete wireless dall'elenco qui sotto.";
SelectedNetworkPasswordTitle = "Password:";
NetworkSelectContinueDescription= "Fai clic su Continua per aggiungere il dispositivo a \"%@\".";
NetworkDiscoveryFailedTitle = "Rilevazione rete non riuscita";
NetworkDiscoveryFailedDescription = "Non sono state rilevate reti wireless.";
SetupNetworkSelectedTitle = "Selezionare un'altra rete";
SetupNetworkSelectedDescription = "Si sta tentando di eseguire la connessione a una rete speciale creata da un dispositivo di stampa. Fare clic su OK e selezionare un'altra rete.";

NetworkNotAvailableTitle = "Rete non disponibile";
DeviceNetworkNotAvailableMessageFormat = "Il dispositivo non è potuto accedere alla rete wireless \"%@\". Accertarsi che il punto di accesso wireless funzioni correttamente e che il dispositivo utilizzato sia entro la portata del segnale wireless oppure selezionare un'altra rete.";
MacNetworkNotAvailableMessageFormat = "Il Mac non è stato in grado di accedere alla rete wireless \"%@\". Verificare che il punto di accesso wireless funzioni correttamente e si trovi entro la portata del Mac oppure scegliere un'altra rete.";
ChangeNetworkButtonTitle= "Modifica rete";

LookingForNetworkMessageFormat = "Ricerca della rete \"%@\" in corso";

UnsupportedNetworkTitle = "Rete non supportata";
UnsupportedNetworkMessageFormat = "Scegliere un'altra rete o rivolgersi all'amministratore di rete per assistenza.";

EnterpriseNetworkAlertTitle = "Rete aziendale selezionata";
EnterpriseNetworkAlertForUSBConnectionMessage = "Queste rete è protetta da un tipo di crittografia aziendale. Connettere la stampante alla stessa rete del computer, quindi utilizzare il server Web incorporato oppure contattare l'amministratore.";
EnterpriseNetworkAlertForNetworkConnectionMessage = "Questa rete è protetta da un tipo di crittografia aziendale. Per connettere la stampante alla rete, utilizzare il server Web incorporato (EWS) oppure contattare l'amministratore. Se si decide di utilizzare l'EWS, il computer si disconnetterà dalla rete wireless e si connetterà a una rete speciale creata dalla stampante.";
ConfigureUsingEWSButtonTitle = "Configura tramite EWS";
ConnectingToDeviceProgressTitle = "Connessione del dispositivo alla rete in corso...";

UnableToConnectToDeviceNetworkAlertMessage = "Verifica che il dispositivo sia in vista di questo computer e che la spia luminosa blu sul dispositivo lampeggi per indicare che il dispositivo è in modalità Connessione wireless automatica HP. È possibile ripristinare questa modalità utilizzando l'opzione Ripristina valori predefiniti sul pannello di controllo del dispositivo. Vedi la documentazione del dispositivo per istruzioni in merito.";

// select device
DeviceNameColumnTitle = "Nome dispositivo";
DeviceModelColumnTitle = "Modello dispositivo";
AllFilterTitle = "Tutte";
DevicesFilterLabel = "Dispositivi:";
SupportedDevicesFilterTitle = "Supportato";

// configure
ConfigureTaskName = "Configurazione del dispositivo HP";
ConfigureTitle = "Configurazione in corso...";
NoteTitle = "È in corso la configurazione del dispositivo HP per la connessione a una rete wireless. L'operazione potrebbe richiedere qualche minuto.";
RestoringNetworkSettings = "Ripristino impostazioni di rete in corso...";

// particular errors
IncorrectPasswordTitle = "Password non accettata";
IncorrectPasswordDescription = "La password non è stata accettata dalla rete wireless \"%@\".\n\nReimmettere la password.";

DuplicateNetworkNameErrorTitle = "Nomi di reti WiFi duplicati";
DuplicateNetworkNameErrorDescription = "Rilevate reti WiFi con \"%@\" duplicati. Verificare le impostazioni del router wireless.";

MacAddressFilterErrorTitle = "Errore filtro WiFi";
MacAddressFilterErrorDescription = "L'indirizzo hardware MAC del dispositivo è stato escluso dal filtro e non è disponibile in \"%@\". Verificare le impostazioni del router wireless.";

WeakSignalStrengthErrorTitle = "Potenza segnale debole";
WeakSignalStrengthErrorDescription = "La potenzia del segnale del router wireless \"%@\" è debole. Avvicinare il dispositivo al router.";

DeviceNotReachableErrorTitle = "Dispositivo non raggiungibile";
DeviceNotReachableErrorDescription = "Le impostazioni della rete wireless sono state scaricate sul dispositivo. Tuttavia, il Mac non è stato in grado di individuare il dispositivo sulla rete.\n\nAccertarsi che:\n• il Mac sia collegato ad una rete cablata o wireless che abbia accesso al dispositivo.\n• il dispositivo sia collegato alla rete wireless \"%@\".";

EmptyPasswordError = "È richiesta la password.";
TooShortWPAPersonalPasswordError = "La password deve avere almeno 8 caratteri.";
TooLongWPAPersonalPasswordError = "La password non può avere più di 64 caratteri.";

// restore original network errors

FailedToRestoreOriginalNetworkErrorTitle = "Impossibile ripristinare la connessione con la rete wireless originaria";

NoPasswordIsStoredInKeychainErrorMessageFormat = "L'Assistente non è riuscito a ripristinare le credenziali della rete wireless \"%@\" dall'archivio credenziali dell'utente. Verificare che il proprio Mac sia connesso a una rete cablata o wireless che abbia accesso al dispositivo.";
PasswordFromKeychainNotAcceptedErrorMessageFormat = "Le credenziali dell'utente non sono state accettate dalla rete wireless \"%@\". Verificare che il proprio Mac sia connesso a una rete cablata o wireless che abbia accesso al dispositivo.";
FailedToRestoreOriginalNetworkGenericErrorMessage = "Verificare che il punto di accesso wireless funzioni correttamente e si trovi a portata utile del Mac, quindi provare a stabilire la connessione manualmente.";

// results
ManualNetworkConfigurationTitle = "Manuale";
AutoNetworkConfigurationTitle = "Automatica";
LinklocalNetworkConfigurationTitle = "Link locale";
NetworkSettingsTitle = "Impostazioni di rete";
ConfigurationFailedTaskName = "Configurazione non riuscita";
ConfigurationCompleteTaskName = "Configurazione completata";
ConfigurationFailedTitle = "L'assistente non è riuscito a configurare il dispositivo tramite una connessione wireless.";
ConfigurationSucceededTitle = "Il dispositivo HP è configurato correttamente e si è collegato alla rete \"%@\".";

ConfigurationFailedNote = "Verificare che il punto di accesso wireless funzioni correttamente e che il dispositivo si trovi entro la distanza di rilevazione e sia acceso ma inattivo, quindi fare clic su Riprova per fare un altro tentativo.\n\n%@";
UnableToConnectToDeviceNetworkUSBSOWMessage = "Verifica che il tuo dispositivo sia acceso e in vista di questo computer, quindi fai clic su Riprova per fare un altro tentativo. La spia luminosa blu sul dispositivo dovrebbe lampeggiare per indicare che il dispositivo è in modalità Connessione wireless automatica HP. Quando il dispositivo viene acceso per la prima volta dopo l'installazione, rimane in questa modalità fino a un massimo di un'ora in attesa di connettersi a una rete.\n\n%@";
UnableToConnectToDeviceNetworkFPWithoutIndicatorSOWMessage = "Assicurarsi che il dispositivo sia visualizzato da questo computer e in modalità HP Auto Wireless Connect. Quindi fare clic su Riprova per fare un altro tentativo. È possibile ripristinare la modalità HP Auto Wireless Connect usando l'opzione Ripristina impostazioni di rete predefinite sul pannello di controllo del dispositivo. Fare riferimento alla documentazione fornita con il dispositivo per le relative istruzioni.\n\n%@";
UnableToConnectToDeviceNetworkFPWithIndicatorSOWMessage = "Verifica che il tuo dispositivo sia in vista di questo computer e che la spia luminosa blu sul dispositivo lampeggi per indicare che il dispositivo è in modalità Connessione wireless automatica HP. Quindi, fai clic su Riprova per fare un altro tentativo. È possibile ripristinare la modalità Connessione wireless automatica HP utilizzando l'opzione Ripristina valori predefiniti sul pannello di controllo del dispositivo. Vedi la documentazione del dispositivo per istruzioni in merito.\n\n%@";
ConfigurationFailedUSBSOWPart = "In alternativa, configurare il dispositivo connettendolo a questo computer tramite un cavo USB e facendo clic su Riprova. Una configurato il dispositivo per la connessione alla rete scelta in precedenza, disconnetterlo dal computer.";
ConfigurationFailedFPSOWPart = "In alternativa, configurare il dispositivo per la rete wireless utilizzando l'Installazione guidata wireless accessibile dal pannello di controllo del dispositivo. Fare quanto segue:
       1. Premere il pulsante Wireless oppure toccare l'icona Wireless sul dispositivo.
       2. Sul display del dispositivo, aprire la schermata di stato Wireless e selezionare Impostazioni.
       3. Selezionare Installazione guidata wireless e seguire le istruzioni visualizzate sullo schermo.


Una volta completata l'installazione guidata, il dispositivo verrà connesso automaticamente alla rete wireless.";


ConfigurationOverUSBFailedTitle = "L'assistente non è riuscito a configurare il dispositivo tramite una connessione USB.";
ConfigurationOverUSBFailedNote = "Verificare che il punto di accesso wireless funzioni correttamente e che il dispositivo si trovi entro la distanza di rilevazione e sia acceso ma inattivo, quindi fare clic su Riprova per fare un altro tentativo.";
MoreInfoText = "Per ulteriori informazioni online, visitare il sito";
FailedTitle = "Impossibile recuperare le informazioni sulla rete";
BonjourServiceNameLabel = "Nome servizio Bonjour:";
IPAddress = "Indirizzo IP:";
AddressMode = "Modalità indirizzo:";
SubnetMask = "Subnet mask:";
DefaultGateway = "Gateway di default:";
HostName = "Nome host:";
PrefixLength = "Lunghezza prefisso:";
DisconnectUSBWarningText = "<b>Importante:</b> scollegare il cavo USB connesso al dispositivo.";
DeviceNotLocatedWarningText = "Le impostazioni delle rete wireless sono state scaricate correttamente sul dispositivo. Tuttavia, il Mac non è riuscito a rilevare il dispositivo sulla rete.";

// network settings
Adhoc = "Adhoc";
Infrastructure = "Infrastruttura";

// select network
NetworkColumnTitle = "Rete";
SignalStrengthColumnTitle = "Potenza segnale";
EncryptionColumnTitle = "Codifica";
ModeColumnTitle = "Modalità";
